Revit 2026 API

# ReleaseConditions Properties

---

The ReleaseConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Fx | Gets or Sets the Fx of the release type. |
|  | Fy | Gets or Sets the Fy of the release type. |
|  | Fz | Gets or Sets the Fz of the release type. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Mx | Gets or Sets the Mx of the release type. |
|  | My | Gets or Sets the My of the release type. |
|  | Mz | Gets or Sets the Mz of the release type. |
|  | Start | Gets or Sets the position of release type. True for start, false for end. |

#### Reference

ReleaseConditions Class

Autodesk.Revit.DB.Structure Namespace